Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_usart_echo_interrupt/firmware/src/packs/ATSAMA5D27_DFP/component/mpddrc.h
/* -------- MPDDRC_CR : (MPDDRC Offset: 0x08) (R/W 32) Configuration Register -------- */
#define MPDDRC_CR_NC_Pos                      _U_(0)                                               /**< (MPDDRC_CR) Number of Column Bits Position */
#define MPDDRC_CR_NC_Msk                      (_U_(0x3) << MPDDRC_CR_NC_Pos)                       /**< (MPDDRC_CR) Number of Column Bits Mask */
#define MPDDRC_CR_NC(value)                   (MPDDRC_CR_NC_Msk & ((value) << MPDDRC_CR_NC_Pos))  
#define   MPDDRC_CR_NC_DDR9_MDDR8_COL_BITS_Val _U_(0x0)                                             /**< (MPDDRC_CR) 9 bits to define the column number, up to 512 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 8 bits to define the column number, up to 256 columns, for LPDDR1-SDRAM  */
#define   MPDDRC_CR_NC_DDR10_MDDR9_COL_BITS_Val _U_(0x1)                                             /**< (MPDDRC_CR) 10 bits to define the column number, up to 1024 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 9 bits to define the column number, up to 512 columns, for LPDDR1-SDRAM  */
#define   MPDDRC_CR_NC_DDR11_MDDR10_COL_BITS_Val _U_(0x2)                                             /**< (MPDDRC_CR) 11 bits to define the column number, up to 2048 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 10 bits to define the column number, up to 1024 columns, for LPDDR1-SDRAM  */
#define   MPDDRC_CR_NC_DDR12_MDDR11_COL_BITS_Val _U_(0x3)                                             /**< (MPDDRC_CR) 12 bits to define the column number, up to 4096 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 11 bits to define the column number, up to 2048 columns, for LPDDR1-SDRAM  */
#define MPDDRC_CR_NC_DDR9_MDDR8_COL_BITS      (MPDDRC_CR_NC_DDR9_MDDR8_COL_BITS_Val << MPDDRC_CR_NC_Pos) /**< (MPDDRC_CR) 9 bits to define the column number, up to 512 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 8 bits to define the column number, up to 256 columns, for LPDDR1-SDRAM Position  */
#define MPDDRC_CR_NC_DDR10_MDDR9_COL_BITS     (MPDDRC_CR_NC_DDR10_MDDR9_COL_BITS_Val << MPDDRC_CR_NC_Pos) /**< (MPDDRC_CR) 10 bits to define the column number, up to 1024 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 9 bits to define the column number, up to 512 columns, for LPDDR1-SDRAM Position  */
#define MPDDRC_CR_NC_DDR11_MDDR10_COL_BITS    (MPDDRC_CR_NC_DDR11_MDDR10_COL_BITS_Val << MPDDRC_CR_NC_Pos) /**< (MPDDRC_CR) 11 bits to define the column number, up to 2048 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 10 bits to define the column number, up to 1024 columns, for LPDDR1-SDRAM Position  */
#define MPDDRC_CR_NC_DDR12_MDDR11_COL_BITS    (MPDDRC_CR_NC_DDR12_MDDR11_COL_BITS_Val << MPDDRC_CR_NC_Pos) /**< (MPDDRC_CR) 12 bits to define the column number, up to 4096 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 11 bits to define the column number, up to 2048 columns, for LPDDR1-SDRAM Position  */
#define MPDDRC_CR_NR_Pos                      _U_(2)                                               /**< (MPDDRC_CR) Number of Row Bits Position */
#define MPDDRC_CR_NR_Msk                      (_U_(0x3) << MPDDRC_CR_NR_Pos)                       /**< (MPDDRC_CR) Number of Row Bits Mask */
#define MPDDRC_CR_NR(value)                   (MPDDRC_CR_NR_Msk & ((value) << MPDDRC_CR_NR_Pos))  
#define   MPDDRC_CR_NR_11_ROW_BITS_Val        _U_(0x0)                                             /**< (MPDDRC_CR) 11 bits to define the row number, up to 2048 rows  */
#define   MPDDRC_CR_NR_12_ROW_BITS_Val        _U_(0x1)                                             /**< (MPDDRC_CR) 12 bits to define the row number, up to 4096 rows  */
#define   MPDDRC_CR_NR_13_ROW_BITS_Val        _U_(0x2)                                             /**< (MPDDRC_CR) 13 bits to define the row number, up to 8192 rows  */
#define   MPDDRC_CR_NR_14_ROW_BITS_Val        _U_(0x3)                                             /**< (MPDDRC_CR) 14 bits to define the row number, up to 16384 rows  */
#define MPDDRC_CR_NR_11_ROW_BITS              (MPDDRC_CR_NR_11_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 11 bits to define the row number, up to 2048 rows Position  */
#define MPDDRC_CR_NR_12_ROW_BITS              (MPDDRC_CR_NR_12_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 12 bits to define the row number, up to 4096 rows Position  */
#define MPDDRC_CR_NR_13_ROW_BITS              (MPDDRC_CR_NR_13_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 13 bits to define the row number, up to 8192 rows Position  */
#define MPDDRC_CR_NR_14_ROW_BITS              (MPDDRC_CR_NR_14_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 14 bits to define the row number, up to 16384 rows Position  */
#define MPDDRC_CR_CAS_Pos                     _U_(4)                                               /**< (MPDDRC_CR) CAS Latency Position */
#define MPDDRC_CR_CAS_Msk                     (_U_(0x7) << MPDDRC_CR_CAS_Pos)                      /**< (MPDDRC_CR) CAS Latency Mask */
#define MPDDRC_CR_CAS(value)                  (MPDDRC_CR_CAS_Msk & ((value) << MPDDRC_CR_CAS_Pos))
#define   MPDDRC_CR_CAS_DDR_CAS2_Val          _U_(0x2)                                             /**< (MPDDRC_CR) LPDDR1 CAS Latency 2  */
#define   MPDDRC_CR_CAS_DDR_CAS3_Val          _U_(0x3)                                             /**< (MPDDRC_CR) LPDDR3/DDR2/LPDDR2/LPDDR1 CAS Latency 3  */
#define   MPDDRC_CR_CAS_DDR_CAS5_Val          _U_(0x5)                                             /**< (MPDDRC_CR) DDR3 CAS Latency 5  */
#define   MPDDRC_CR_CAS_DDR_CAS6_Val          _U_(0x6)                                             /**< (MPDDRC_CR) DDR3LPDDR3 CAS Latency 6  */
#define MPDDRC_CR_CAS_DDR_CAS2                (MPDDRC_CR_CAS_DDR_CAS2_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) LPDDR1 CAS Latency 2 Position  */
#define MPDDRC_CR_CAS_DDR_CAS3                (MPDDRC_CR_CAS_DDR_CAS3_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) LPDDR3/DDR2/LPDDR2/LPDDR1 CAS Latency 3 Position  */
#define MPDDRC_CR_CAS_DDR_CAS5                (MPDDRC_CR_CAS_DDR_CAS5_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) DDR3 CAS Latency 5 Position  */
#define MPDDRC_CR_CAS_DDR_CAS6                (MPDDRC_CR_CAS_DDR_CAS6_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) DDR3LPDDR3 CAS Latency 6 Position  */
#define MPDDRC_CR_DLL_Pos                     _U_(7)                                               /**< (MPDDRC_CR) Reset DLL Position */
#define MPDDRC_CR_DLL_Msk                     (_U_(0x1) << MPDDRC_CR_DLL_Pos)                      /**< (MPDDRC_CR) Reset DLL Mask */
#define MPDDRC_CR_DLL(value)                  (MPDDRC_CR_DLL_Msk & ((value) << MPDDRC_CR_DLL_Pos))
#define   MPDDRC_CR_DLL_RESET_DISABLED_Val    _U_(0x0)                                             /**< (MPDDRC_CR) Disable DLL reset  */
#define   MPDDRC_CR_DLL_RESET_ENABLED_Val     _U_(0x1)                                             /**< (MPDDRC_CR) Enable DLL reset  */
#define MPDDRC_CR_DLL_RESET_DISABLED          (MPDDRC_CR_DLL_RESET_DISABLED_Val << MPDDRC_CR_DLL_Pos) /**< (MPDDRC_CR) Disable DLL reset Position  */
#define MPDDRC_CR_DLL_RESET_ENABLED           (MPDDRC_CR_DLL_RESET_ENABLED_Val << MPDDRC_CR_DLL_Pos) /**< (MPDDRC_CR) Enable DLL reset Position  */
#define MPDDRC_CR_DIC_DS_Pos                  _U_(8)                                               /**< (MPDDRC_CR) Output Driver Impedance Control (Drive Strength) Position */
#define MPDDRC_CR_DIC_DS_Msk                  (_U_(0x1) << MPDDRC_CR_DIC_DS_Pos)                   /**< (MPDDRC_CR) Output Driver Impedance Control (Drive Strength) Mask */
#define MPDDRC_CR_DIC_DS(value)               (MPDDRC_CR_DIC_DS_Msk & ((value) << MPDDRC_CR_DIC_DS_Pos))
#define   MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH_DDR3_RZQ6_Val _U_(0x0)                                             /**< (MPDDRC_CR) Normal drive strength (DDR2) - RZQ/6 (40 [NOM], DDR3)  */
#define   MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH_DDR3_RZQ7_Val _U_(0x1)                                             /**< (MPDDRC_CR) Weak drive strength (DDR2) - RZQ/7 (34 [NOM], DDR3)  */
#define MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH_DDR3_RZQ6 (MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH_DDR3_RZQ6_Val << MPDDRC_CR_DIC_DS_Pos) /**< (MPDDRC_CR) Normal drive strength (DDR2) - RZQ/6 (40 [NOM], DDR3) Position  */
#define MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH_DDR3_RZQ7 (MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH_DDR3_RZQ7_Val << MPDDRC_CR_DIC_DS_Pos) /**< (MPDDRC_CR) Weak drive strength (DDR2) - RZQ/7 (34 [NOM], DDR3) Position  */
#define MPDDRC_CR_DIS_DLL_Pos                 _U_(9)                                               /**< (MPDDRC_CR) DISABLE DLL Position */
#define MPDDRC_CR_DIS_DLL_Msk                 (_U_(0x1) << MPDDRC_CR_DIS_DLL_Pos)                  /**< (MPDDRC_CR) DISABLE DLL Mask */
#define MPDDRC_CR_DIS_DLL(value)              (MPDDRC_CR_DIS_DLL_Msk & ((value) << MPDDRC_CR_DIS_DLL_Pos))
#define MPDDRC_CR_ZQ_Pos                      _U_(10)                                              /**< (MPDDRC_CR) ZQ Calibration Position */
#define MPDDRC_CR_ZQ_Msk                      (_U_(0x3) << MPDDRC_CR_ZQ_Pos)                       /**< (MPDDRC_CR) ZQ Calibration Mask */
#define MPDDRC_CR_ZQ(value)                   (MPDDRC_CR_ZQ_Msk & ((value) << MPDDRC_CR_ZQ_Pos))  
#define   MPDDRC_CR_ZQ_INIT_Val               _U_(0x0)                                             /**< (MPDDRC_CR) Calibration command after initialization  */
#define   MPDDRC_CR_ZQ_LONG_Val               _U_(0x1)                                             /**< (MPDDRC_CR) Long calibration  */
#define   MPDDRC_CR_ZQ_SHORT_Val              _U_(0x2)                                             /**< (MPDDRC_CR) Short calibration  */
#define   MPDDRC_CR_ZQ_RESET_Val              _U_(0x3)                                             /**< (MPDDRC_CR) ZQ Reset  */
#define MPDDRC_CR_ZQ_INIT                     (MPDDRC_CR_ZQ_INIT_Val << MPDDRC_CR_ZQ_Pos)          /**< (MPDDRC_CR) Calibration command after initialization Position  */
#define MPDDRC_CR_ZQ_LONG                     (MPDDRC_CR_ZQ_LONG_Val << MPDDRC_CR_ZQ_Pos)          /**< (MPDDRC_CR) Long calibration Position  */
#define MPDDRC_CR_ZQ_SHORT                    (MPDDRC_CR_ZQ_SHORT_Val << MPDDRC_CR_ZQ_Pos)         /**< (MPDDRC_CR) Short calibration Position  */
#define MPDDRC_CR_ZQ_RESET                    (MPDDRC_CR_ZQ_RESET_Val << MPDDRC_CR_ZQ_Pos)         /**< (MPDDRC_CR) ZQ Reset Position  */
#define MPDDRC_CR_OCD_Pos                     _U_(12)                                              /**< (MPDDRC_CR) Off-chip Driver Position */
#define MPDDRC_CR_OCD_Msk                     (_U_(0x7) << MPDDRC_CR_OCD_Pos)                      /**< (MPDDRC_CR) Off-chip Driver Mask */
#define MPDDRC_CR_OCD(value)                  (MPDDRC_CR_OCD_Msk & ((value) << MPDDRC_CR_OCD_Pos))
#define   MPDDRC_CR_OCD_DDR2_EXITCALIB_Val    _U_(0x0)                                             /**< (MPDDRC_CR) Exit from OCD Calibration mode and maintain settings  */
#define   MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB_Val _U_(0x7)                                             /**< (MPDDRC_CR) OCD calibration default  */
#define MPDDRC_CR_OCD_DDR2_EXITCALIB          (MPDDRC_CR_OCD_DDR2_EXITCALIB_Val << MPDDRC_CR_OCD_Pos) /**< (MPDDRC_CR) Exit from OCD Calibration mode and maintain settings Position  */
#define MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB      (MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB_Val << MPDDRC_CR_OCD_Pos) /**< (MPDDRC_CR) OCD calibration default Position  */
#define MPDDRC_CR_DQMS_Pos                    _U_(16)                                              /**< (MPDDRC_CR) Mask Data is Shared Position */
#define MPDDRC_CR_DQMS_Msk                    (_U_(0x1) << MPDDRC_CR_DQMS_Pos)                     /**< (MPDDRC_CR) Mask Data is Shared Mask */
#define MPDDRC_CR_DQMS(value)                 (MPDDRC_CR_DQMS_Msk & ((value) << MPDDRC_CR_DQMS_Pos))
#define   MPDDRC_CR_DQMS_NOT_SHARED_Val       _U_(0x0)                                             /**< (MPDDRC_CR) DQM is not shared with another controller  */
#define   MPDDRC_CR_DQMS_SHARED_Val           _U_(0x1)                                             /**< (MPDDRC_CR) DQM is shared with another controller  */
#define MPDDRC_CR_DQMS_NOT_SHARED             (MPDDRC_CR_DQMS_NOT_SHARED_Val << MPDDRC_CR_DQMS_Pos) /**< (MPDDRC_CR) DQM is not shared with another controller Position  */
#define MPDDRC_CR_DQMS_SHARED                 (MPDDRC_CR_DQMS_SHARED_Val << MPDDRC_CR_DQMS_Pos)    /**< (MPDDRC_CR) DQM is shared with another controller Position  */
#define MPDDRC_CR_ENRDM_Pos                   _U_(17)                                              /**< (MPDDRC_CR) Enable Read Measure Position */
#define MPDDRC_CR_ENRDM_Msk                   (_U_(0x1) << MPDDRC_CR_ENRDM_Pos)                    /**< (MPDDRC_CR) Enable Read Measure Mask */
#define MPDDRC_CR_ENRDM(value)                (MPDDRC_CR_ENRDM_Msk & ((value) << MPDDRC_CR_ENRDM_Pos))
#define   MPDDRC_CR_ENRDM_OFF_Val             _U_(0x0)                                             /**< (MPDDRC_CR) DQS/DDR_DATA phase error correction is disabled  */
#define   MPDDRC_CR_ENRDM_ON_Val              _U_(0x1)                                             /**< (MPDDRC_CR) DQS/DDR_DATA phase error correction is enabled  */
#define MPDDRC_CR_ENRDM_OFF                   (MPDDRC_CR_ENRDM_OFF_Val << MPDDRC_CR_ENRDM_Pos)     /**< (MPDDRC_CR) DQS/DDR_DATA phase error correction is disabled Position  */
#define MPDDRC_CR_ENRDM_ON                    (MPDDRC_CR_ENRDM_ON_Val << MPDDRC_CR_ENRDM_Pos)      /**< (MPDDRC_CR) DQS/DDR_DATA phase error correction is enabled Position  */
#define MPDDRC_CR_LC_LPDDR1_Pos               _U_(19)                                              /**< (MPDDRC_CR) Low-cost Low-power DDR1 Position */
#define MPDDRC_CR_LC_LPDDR1_Msk               (_U_(0x1) << MPDDRC_CR_LC_LPDDR1_Pos)                /**< (MPDDRC_CR) Low-cost Low-power DDR1 Mask */
#define MPDDRC_CR_LC_LPDDR1(value)            (MPDDRC_CR_LC_LPDDR1_Msk & ((value) << MPDDRC_CR_LC_LPDDR1_Pos))
#define   MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS_Val _U_(0x0)                                             /**< (MPDDRC_CR) Any type of memory devices except of low cost, low density Low Power DDR1.  */
#define   MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1_Val _U_(0x1)                                             /**< (MPDDRC_CR) Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.The 32-bit memory device is organized as 2 banks, 8 columns and 11 rows.It is impossible to use two 16-bit memory devices (2 x 32 Mbits) for creating one 32-bit memory device (64 Mbits). In this case, it is recommended to use one 32-bit memory device which embeds four internal banks.  */
#define MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS       (MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS_Val << MPDDRC_CR_LC_LPDDR1_Pos) /**< (MPDDRC_CR) Any type of memory devices except of low cost, low density Low Power DDR1. Position  */
#define MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1    (MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1_Val << MPDDRC_CR_LC_LPDDR1_Pos) /**< (MPDDRC_CR) Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.The 32-bit memory device is organized as 2 banks, 8 columns and 11 rows.It is impossible to use two 16-bit memory devices (2 x 32 Mbits) for creating one 32-bit memory device (64 Mbits). In this case, it is recommended to use one 32-bit memory device which embeds four internal banks. Position  */
#define MPDDRC_CR_NB_Pos                      _U_(20)                                              /**< (MPDDRC_CR) Number of Banks Position */
#define MPDDRC_CR_NB_Msk                      (_U_(0x1) << MPDDRC_CR_NB_Pos)                       /**< (MPDDRC_CR) Number of Banks Mask */
#define MPDDRC_CR_NB(value)                   (MPDDRC_CR_NB_Msk & ((value) << MPDDRC_CR_NB_Pos))  
#define   MPDDRC_CR_NB_4_BANKS_Val            _U_(0x0)                                             /**< (MPDDRC_CR) 4-bank memory devices  */
#define   MPDDRC_CR_NB_8_BANKS_Val            _U_(0x1)                                             /**< (MPDDRC_CR) 8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM and DDR3-SDRAM and low-power DDR3-SDRAM devices.  */
#define MPDDRC_CR_NB_4_BANKS                  (MPDDRC_CR_NB_4_BANKS_Val << MPDDRC_CR_NB_Pos)       /**< (MPDDRC_CR) 4-bank memory devices Position  */
#define MPDDRC_CR_NB_8_BANKS                  (MPDDRC_CR_NB_8_BANKS_Val << MPDDRC_CR_NB_Pos)       /**< (MPDDRC_CR) 8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM and DDR3-SDRAM and low-power DDR3-SDRAM devices. Position  */
#define MPDDRC_CR_NDQS_Pos                    _U_(21)                                              /**< (MPDDRC_CR) Not DQS Position */
#define MPDDRC_CR_NDQS_Msk                    (_U_(0x1) << MPDDRC_CR_NDQS_Pos)                     /**< (MPDDRC_CR) Not DQS Mask */
#define MPDDRC_CR_NDQS(value)                 (MPDDRC_CR_NDQS_Msk & ((value) << MPDDRC_CR_NDQS_Pos))
#define   MPDDRC_CR_NDQS_ENABLED_Val          _U_(0x0)                                             /**< (MPDDRC_CR) Not DQS is enabled  */
#define   MPDDRC_CR_NDQS_DISABLED_Val         _U_(0x1)                                             /**< (MPDDRC_CR) Not DQS is disabled  */
#define MPDDRC_CR_NDQS_ENABLED                (MPDDRC_CR_NDQS_ENABLED_Val << MPDDRC_CR_NDQS_Pos)   /**< (MPDDRC_CR) Not DQS is enabled Position  */
#define MPDDRC_CR_NDQS_DISABLED               (MPDDRC_CR_NDQS_DISABLED_Val << MPDDRC_CR_NDQS_Pos)  /**< (MPDDRC_CR) Not DQS is disabled Position  */
#define MPDDRC_CR_DECOD_Pos                   _U_(22)                                              /**< (MPDDRC_CR) Type of Decoding Position */
#define MPDDRC_CR_DECOD_Msk                   (_U_(0x1) << MPDDRC_CR_DECOD_Pos)                    /**< (MPDDRC_CR) Type of Decoding Mask */
#define MPDDRC_CR_DECOD(value)                (MPDDRC_CR_DECOD_Msk & ((value) << MPDDRC_CR_DECOD_Pos))
#define   MPDDRC_CR_DECOD_SEQUENTIAL_Val      _U_(0x0)                                             /**< (MPDDRC_CR) Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank.  */
#define   MPDDRC_CR_DECOD_INTERLEAVED_Val     _U_(0x1)                                             /**< (MPDDRC_CR) Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank.  */
#define MPDDRC_CR_DECOD_SEQUENTIAL            (MPDDRC_CR_DECOD_SEQUENTIAL_Val << MPDDRC_CR_DECOD_Pos) /**< (MPDDRC_CR) Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank. Position  */
#define MPDDRC_CR_DECOD_INTERLEAVED           (MPDDRC_CR_DECOD_INTERLEAVED_Val << MPDDRC_CR_DECOD_Pos) /**< (MPDDRC_CR) Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank. Position  */
#define MPDDRC_CR_UNAL_Pos                    _U_(23)                                              /**< (MPDDRC_CR) Support Unaligned Access Position */
#define MPDDRC_CR_UNAL_Msk                    (_U_(0x1) << MPDDRC_CR_UNAL_Pos)                     /**< (MPDDRC_CR) Support Unaligned Access Mask */
#define MPDDRC_CR_UNAL(value)                 (MPDDRC_CR_UNAL_Msk & ((value) << MPDDRC_CR_UNAL_Pos))
#define   MPDDRC_CR_UNAL_UNSUPPORTED_Val      _U_(0x0)                                             /**< (MPDDRC_CR) Unaligned access is not supported.  */
#define   MPDDRC_CR_UNAL_SUPPORTED_Val        _U_(0x1)                                             /**< (MPDDRC_CR) Unaligned access is supported.  */
#define MPDDRC_CR_UNAL_UNSUPPORTED            (MPDDRC_CR_UNAL_UNSUPPORTED_Val << MPDDRC_CR_UNAL_Pos) /**< (MPDDRC_CR) Unaligned access is not supported. Position  */
#define MPDDRC_CR_UNAL_SUPPORTED              (MPDDRC_CR_UNAL_SUPPORTED_Val << MPDDRC_CR_UNAL_Pos) /**< (MPDDRC_CR) Unaligned access is supported. Position  */
#define MPDDRC_CR_Msk                         _U_(0x00FB7FFF)                                      /**< (MPDDRC_CR) Register Mask  */

#define MPDDRC_CR_LC_LPDDR_Pos                _U_(19)                                              /**< (MPDDRC_CR Position) Low-cost Low-power DDRx */
#define MPDDRC_CR_LC_LPDDR_Msk                (_U_(0x1) << MPDDRC_CR_LC_LPDDR_Pos)                 /**< (MPDDRC_CR Mask) LC_LPDDR */
#define MPDDRC_CR_LC_LPDDR(value)             (MPDDRC_CR_LC_LPDDR_Msk & ((value) << MPDDRC_CR_LC_LPDDR_Pos)) 

