Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_usart_echo_interrupt/firmware/src/packs/ATSAMA5D27_DFP/component/mpddrc.h
/* -------- MPDDRC_TPR0 : (MPDDRC Offset: 0x0C) (R/W 32) Timing Parameter 0 Register -------- */
#define MPDDRC_TPR0_TRAS_Pos                  _U_(0)                                               /**< (MPDDRC_TPR0) Active to Precharge Delay Position */
#define MPDDRC_TPR0_TRAS_Msk                  (_U_(0xF) << MPDDRC_TPR0_TRAS_Pos)                   /**< (MPDDRC_TPR0) Active to Precharge Delay Mask */
#define MPDDRC_TPR0_TRAS(value)               (MPDDRC_TPR0_TRAS_Msk & ((value) << MPDDRC_TPR0_TRAS_Pos))
#define MPDDRC_TPR0_TRCD_Pos                  _U_(4)                                               /**< (MPDDRC_TPR0) Row to Column Delay Position */
#define MPDDRC_TPR0_TRCD_Msk                  (_U_(0xF) << MPDDRC_TPR0_TRCD_Pos)                   /**< (MPDDRC_TPR0) Row to Column Delay Mask */
#define MPDDRC_TPR0_TRCD(value)               (MPDDRC_TPR0_TRCD_Msk & ((value) << MPDDRC_TPR0_TRCD_Pos))
#define MPDDRC_TPR0_TWR_Pos                   _U_(8)                                               /**< (MPDDRC_TPR0) Write Recovery Delay Position */
#define MPDDRC_TPR0_TWR_Msk                   (_U_(0xF) << MPDDRC_TPR0_TWR_Pos)                    /**< (MPDDRC_TPR0) Write Recovery Delay Mask */
#define MPDDRC_TPR0_TWR(value)                (MPDDRC_TPR0_TWR_Msk & ((value) << MPDDRC_TPR0_TWR_Pos))
#define MPDDRC_TPR0_TRC_Pos                   _U_(12)                                              /**< (MPDDRC_TPR0) Row Cycle Delay Position */
#define MPDDRC_TPR0_TRC_Msk                   (_U_(0xF) << MPDDRC_TPR0_TRC_Pos)                    /**< (MPDDRC_TPR0) Row Cycle Delay Mask */
#define MPDDRC_TPR0_TRC(value)                (MPDDRC_TPR0_TRC_Msk & ((value) << MPDDRC_TPR0_TRC_Pos))
#define MPDDRC_TPR0_TRP_Pos                   _U_(16)                                              /**< (MPDDRC_TPR0) Row Precharge Delay Position */
#define MPDDRC_TPR0_TRP_Msk                   (_U_(0xF) << MPDDRC_TPR0_TRP_Pos)                    /**< (MPDDRC_TPR0) Row Precharge Delay Mask */
#define MPDDRC_TPR0_TRP(value)                (MPDDRC_TPR0_TRP_Msk & ((value) << MPDDRC_TPR0_TRP_Pos))
#define MPDDRC_TPR0_TRRD_Pos                  _U_(20)                                              /**< (MPDDRC_TPR0) Active BankA to Active BankB Position */
#define MPDDRC_TPR0_TRRD_Msk                  (_U_(0xF) << MPDDRC_TPR0_TRRD_Pos)                   /**< (MPDDRC_TPR0) Active BankA to Active BankB Mask */
#define MPDDRC_TPR0_TRRD(value)               (MPDDRC_TPR0_TRRD_Msk & ((value) << MPDDRC_TPR0_TRRD_Pos))
#define MPDDRC_TPR0_TWTR_Pos                  _U_(24)                                              /**< (MPDDRC_TPR0) Internal Write to Read Delay Position */
#define MPDDRC_TPR0_TWTR_Msk                  (_U_(0xF) << MPDDRC_TPR0_TWTR_Pos)                   /**< (MPDDRC_TPR0) Internal Write to Read Delay Mask */
#define MPDDRC_TPR0_TWTR(value)               (MPDDRC_TPR0_TWTR_Msk & ((value) << MPDDRC_TPR0_TWTR_Pos))
#define MPDDRC_TPR0_TMRD_Pos                  _U_(28)                                              /**< (MPDDRC_TPR0) Load Mode Register Command to Activate or Refresh Command Position */
#define MPDDRC_TPR0_TMRD_Msk                  (_U_(0xF) << MPDDRC_TPR0_TMRD_Pos)                   /**< (MPDDRC_TPR0) Load Mode Register Command to Activate or Refresh Command Mask */
#define MPDDRC_TPR0_TMRD(value)               (MPDDRC_TPR0_TMRD_Msk & ((value) << MPDDRC_TPR0_TMRD_Pos))
#define MPDDRC_TPR0_Msk                       _U_(0xFFFFFFFF)                                      /**< (MPDDRC_TPR0) Register Mask  */


/* -------- MPDDRC_TPR1 : (MPDDRC Offset: 0x10) (R/W 32) Timing Parameter 1 Register -------- */
#define MPDDRC_TPR1_TRFC_Pos                  _U_(0)                                               /**< (MPDDRC_TPR1) Row Cycle Delay Position */
#define MPDDRC_TPR1_TRFC_Msk                  (_U_(0x7F) << MPDDRC_TPR1_TRFC_Pos)                  /**< (MPDDRC_TPR1) Row Cycle Delay Mask */
#define MPDDRC_TPR1_TRFC(value)               (MPDDRC_TPR1_TRFC_Msk & ((value) << MPDDRC_TPR1_TRFC_Pos))
#define MPDDRC_TPR1_TXSNR_Pos                 _U_(8)                                               /**< (MPDDRC_TPR1) Exit Self-refresh Delay to Non-Read Command Position */
#define MPDDRC_TPR1_TXSNR_Msk                 (_U_(0xFF) << MPDDRC_TPR1_TXSNR_Pos)                 /**< (MPDDRC_TPR1) Exit Self-refresh Delay to Non-Read Command Mask */
#define MPDDRC_TPR1_TXSNR(value)              (MPDDRC_TPR1_TXSNR_Msk & ((value) << MPDDRC_TPR1_TXSNR_Pos))
#define MPDDRC_TPR1_TXSRD_Pos                 _U_(16)                                              /**< (MPDDRC_TPR1) Exit Self-refresh Delay to Read Command Position */
#define MPDDRC_TPR1_TXSRD_Msk                 (_U_(0xFF) << MPDDRC_TPR1_TXSRD_Pos)                 /**< (MPDDRC_TPR1) Exit Self-refresh Delay to Read Command Mask */
#define MPDDRC_TPR1_TXSRD(value)              (MPDDRC_TPR1_TXSRD_Msk & ((value) << MPDDRC_TPR1_TXSRD_Pos))
#define MPDDRC_TPR1_TXP_Pos                   _U_(24)                                              /**< (MPDDRC_TPR1) Exit Powerdown Delay to First Command Position */
#define MPDDRC_TPR1_TXP_Msk                   (_U_(0xF) << MPDDRC_TPR1_TXP_Pos)                    /**< (MPDDRC_TPR1) Exit Powerdown Delay to First Command Mask */
#define MPDDRC_TPR1_TXP(value)                (MPDDRC_TPR1_TXP_Msk & ((value) << MPDDRC_TPR1_TXP_Pos))
#define MPDDRC_TPR1_Msk                       _U_(0x0FFFFF7F)                                      /**< (MPDDRC_TPR1) Register Mask  */


/* -------- MPDDRC_TPR2 : (MPDDRC Offset: 0x14) (R/W 32) Timing Parameter 2 Register -------- */
#define MPDDRC_TPR2_TXARD_Pos                 _U_(0)                                               /**< (MPDDRC_TPR2) Exit Active Power Down Delay to Read Command in Mode "Fast Exit" Position */
#define MPDDRC_TPR2_TXARD_Msk                 (_U_(0xF) << MPDDRC_TPR2_TXARD_Pos)                  /**< (MPDDRC_TPR2) Exit Active Power Down Delay to Read Command in Mode "Fast Exit" Mask */
#define MPDDRC_TPR2_TXARD(value)              (MPDDRC_TPR2_TXARD_Msk & ((value) << MPDDRC_TPR2_TXARD_Pos))
#define MPDDRC_TPR2_TXARDS_Pos                _U_(4)                                               /**< (MPDDRC_TPR2) Exit Active Power Down Delay to Read Command in Mode "Slow Exit" Position */
#define MPDDRC_TPR2_TXARDS_Msk                (_U_(0xF) << MPDDRC_TPR2_TXARDS_Pos)                 /**< (MPDDRC_TPR2) Exit Active Power Down Delay to Read Command in Mode "Slow Exit" Mask */
#define MPDDRC_TPR2_TXARDS(value)             (MPDDRC_TPR2_TXARDS_Msk & ((value) << MPDDRC_TPR2_TXARDS_Pos))
#define MPDDRC_TPR2_TRPA_Pos                  _U_(8)                                               /**< (MPDDRC_TPR2) Row Precharge All Delay Position */
#define MPDDRC_TPR2_TRPA_Msk                  (_U_(0xF) << MPDDRC_TPR2_TRPA_Pos)                   /**< (MPDDRC_TPR2) Row Precharge All Delay Mask */
#define MPDDRC_TPR2_TRPA(value)               (MPDDRC_TPR2_TRPA_Msk & ((value) << MPDDRC_TPR2_TRPA_Pos))
#define MPDDRC_TPR2_TRTP_Pos                  _U_(12)                                              /**< (MPDDRC_TPR2) Read to Precharge Position */
#define MPDDRC_TPR2_TRTP_Msk                  (_U_(0x7) << MPDDRC_TPR2_TRTP_Pos)                   /**< (MPDDRC_TPR2) Read to Precharge Mask */
#define MPDDRC_TPR2_TRTP(value)               (MPDDRC_TPR2_TRTP_Msk & ((value) << MPDDRC_TPR2_TRTP_Pos))
#define MPDDRC_TPR2_TFAW_Pos                  _U_(16)                                              /**< (MPDDRC_TPR2) Four Active Windows Position */
#define MPDDRC_TPR2_TFAW_Msk                  (_U_(0xF) << MPDDRC_TPR2_TFAW_Pos)                   /**< (MPDDRC_TPR2) Four Active Windows Mask */
#define MPDDRC_TPR2_TFAW(value)               (MPDDRC_TPR2_TFAW_Msk & ((value) << MPDDRC_TPR2_TFAW_Pos))
#define MPDDRC_TPR2_Msk                       _U_(0x000F7FFF)                                      /**< (MPDDRC_TPR2) Register Mask  */


/* -------- MPDDRC_LPR : (MPDDRC Offset: 0x1C) (R/W 32) Low-Power Register -------- */
#define MPDDRC_LPR_LPCB_Pos                   _U_(0)                                               /**< (MPDDRC_LPR) Low-power Command Bit Position */
#define MPDDRC_LPR_LPCB_Msk                   (_U_(0x3) << MPDDRC_LPR_LPCB_Pos)                    /**< (MPDDRC_LPR) Low-power Command Bit Mask */
#define MPDDRC_LPR_LPCB(value)                (MPDDRC_LPR_LPCB_Msk & ((value) << MPDDRC_LPR_LPCB_Pos))
#define   MPDDRC_LPR_LPCB_NOLOWPOWER_Val      _U_(0x0)                                             /**< (MPDDRC_LPR) Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device.  */
#define   MPDDRC_LPR_LPCB_SELFREFRESH_Val     _U_(0x1)                                             /**< (MPDDRC_LPR) The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access.  */
#define   MPDDRC_LPR_LPCB_POWERDOWN_Val       _U_(0x2)                                             /**< (MPDDRC_LPR) The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access.  */
#define   MPDDRC_LPR_LPCB_DEEPPOWERDOWN_Val   _U_(0x3)                                             /**< (MPDDRC_LPR) The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device.  */
#define MPDDRC_LPR_LPCB_NOLOWPOWER            (MPDDRC_LPR_LPCB_NOLOWPOWER_Val << MPDDRC_LPR_LPCB_Pos) /**< (MPDDRC_LPR) Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device. Position  */
#define MPDDRC_LPR_LPCB_SELFREFRESH           (MPDDRC_LPR_LPCB_SELFREFRESH_Val << MPDDRC_LPR_LPCB_Pos) /**< (MPDDRC_LPR) The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access. Position  */
#define MPDDRC_LPR_LPCB_POWERDOWN             (MPDDRC_LPR_LPCB_POWERDOWN_Val << MPDDRC_LPR_LPCB_Pos) /**< (MPDDRC_LPR) The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access. Position  */
#define MPDDRC_LPR_LPCB_DEEPPOWERDOWN         (MPDDRC_LPR_LPCB_DEEPPOWERDOWN_Val << MPDDRC_LPR_LPCB_Pos) /**< (MPDDRC_LPR) The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device. Position  */
#define MPDDRC_LPR_CLK_FR_Pos                 _U_(2)                                               /**< (MPDDRC_LPR) Clock Frozen Command Bit Position */
#define MPDDRC_LPR_CLK_FR_Msk                 (_U_(0x1) << MPDDRC_LPR_CLK_FR_Pos)                  /**< (MPDDRC_LPR) Clock Frozen Command Bit Mask */
#define MPDDRC_LPR_CLK_FR(value)              (MPDDRC_LPR_CLK_FR_Msk & ((value) << MPDDRC_LPR_CLK_FR_Pos))
#define   MPDDRC_LPR_CLK_FR_DISABLED_Val      _U_(0x0)                                             /**< (MPDDRC_LPR) Clock(s) is/are not frozen.  */
#define   MPDDRC_LPR_CLK_FR_ENABLED_Val       _U_(0x1)                                             /**< (MPDDRC_LPR) Clock(s) is/are frozen.  */
#define MPDDRC_LPR_CLK_FR_DISABLED            (MPDDRC_LPR_CLK_FR_DISABLED_Val << MPDDRC_LPR_CLK_FR_Pos) /**< (MPDDRC_LPR) Clock(s) is/are not frozen. Position  */
#define MPDDRC_LPR_CLK_FR_ENABLED             (MPDDRC_LPR_CLK_FR_ENABLED_Val << MPDDRC_LPR_CLK_FR_Pos) /**< (MPDDRC_LPR) Clock(s) is/are frozen. Position  */
#define MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Pos    _U_(3)                                               /**< (MPDDRC_LPR) LPDDR2 - LPDDR3 Power Off Bit Position */
#define MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Msk    (_U_(0x1) << MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Pos)     /**< (MPDDRC_LPR) LPDDR2 - LPDDR3 Power Off Bit Mask */
#define MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF(value) (MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Msk & ((value) << MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Pos))
#define   MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_DISABLED_Val _U_(0x0)                                             /**< (MPDDRC_LPR) No power-off sequence applied to LPDDR2/LPDDR3.  */
#define   MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_ENABLED_Val _U_(0x1)                                             /**< (MPDDRC_LPR) A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low.  */
#define MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_DISABLED (MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_DISABLED_Val << MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Pos) /**< (MPDDRC_LPR) No power-off sequence applied to LPDDR2/LPDDR3. Position  */
#define MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_ENABLED (MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_ENABLED_Val << MPDDRC_LPR_LPDDR2_LPDDR3_PWOFF_Pos) /**< (MPDDRC_LPR) A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low. Position  */
#define MPDDRC_LPR_PASR_Pos                   _U_(4)                                               /**< (MPDDRC_LPR) Partial Array Self-refresh Position */
#define MPDDRC_LPR_PASR_Msk                   (_U_(0x7) << MPDDRC_LPR_PASR_Pos)                    /**< (MPDDRC_LPR) Partial Array Self-refresh Mask */
#define MPDDRC_LPR_PASR(value)                (MPDDRC_LPR_PASR_Msk & ((value) << MPDDRC_LPR_PASR_Pos))
#define MPDDRC_LPR_DS_Pos                     _U_(8)                                               /**< (MPDDRC_LPR) Drive Strength Position */
#define MPDDRC_LPR_DS_Msk                     (_U_(0x7) << MPDDRC_LPR_DS_Pos)                      /**< (MPDDRC_LPR) Drive Strength Mask */
#define MPDDRC_LPR_DS(value)                  (MPDDRC_LPR_DS_Msk & ((value) << MPDDRC_LPR_DS_Pos))
#define   MPDDRC_LPR_DS_DS_FULL_Val           _U_(0x0)                                             /**< (MPDDRC_LPR) Full drive strength  */
#define   MPDDRC_LPR_DS_DS_HALF_Val           _U_(0x1)                                             /**< (MPDDRC_LPR) Half drive strength  */
#define   MPDDRC_LPR_DS_DS_QUARTER_Val        _U_(0x2)                                             /**< (MPDDRC_LPR) Quarter drive strength  */
#define   MPDDRC_LPR_DS_DS_OCTANT_Val         _U_(0x3)                                             /**< (MPDDRC_LPR) Octant drive strength  */
#define MPDDRC_LPR_DS_DS_FULL                 (MPDDRC_LPR_DS_DS_FULL_Val << MPDDRC_LPR_DS_Pos)     /**< (MPDDRC_LPR) Full drive strength Position  */
#define MPDDRC_LPR_DS_DS_HALF                 (MPDDRC_LPR_DS_DS_HALF_Val << MPDDRC_LPR_DS_Pos)     /**< (MPDDRC_LPR) Half drive strength Position  */
#define MPDDRC_LPR_DS_DS_QUARTER              (MPDDRC_LPR_DS_DS_QUARTER_Val << MPDDRC_LPR_DS_Pos)  /**< (MPDDRC_LPR) Quarter drive strength Position  */
#define MPDDRC_LPR_DS_DS_OCTANT               (MPDDRC_LPR_DS_DS_OCTANT_Val << MPDDRC_LPR_DS_Pos)   /**< (MPDDRC_LPR) Octant drive strength Position  */
#define MPDDRC_LPR_TIMEOUT_Pos                _U_(12)                                              /**< (MPDDRC_LPR) Time Between Last Transfer and Low-Power Mode Position */
#define MPDDRC_LPR_TIMEOUT_Msk                (_U_(0x3) << MPDDRC_LPR_TIMEOUT_Pos)                 /**< (MPDDRC_LPR) Time Between Last Transfer and Low-Power Mode Mask */
#define MPDDRC_LPR_TIMEOUT(value)             (MPDDRC_LPR_TIMEOUT_Msk & ((value) << MPDDRC_LPR_TIMEOUT_Pos))
#define   MPDDRC_LPR_TIMEOUT_NONE_Val         _U_(0x0)                                             /**< (MPDDRC_LPR) SDRAM Low-power mode is activated immediately after the end of the last transfer.  */
#define   MPDDRC_LPR_TIMEOUT_DELAY_64_CLK_Val _U_(0x1)                                             /**< (MPDDRC_LPR) SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer.  */
#define   MPDDRC_LPR_TIMEOUT_DELAY_128_CLK_Val _U_(0x2)                                             /**< (MPDDRC_LPR) SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer.  */
#define MPDDRC_LPR_TIMEOUT_NONE               (MPDDRC_LPR_TIMEOUT_NONE_Val << MPDDRC_LPR_TIMEOUT_Pos) /**< (MPDDRC_LPR) SDRAM Low-power mode is activated immediately after the end of the last transfer. Position  */
#define MPDDRC_LPR_TIMEOUT_DELAY_64_CLK       (MPDDRC_LPR_TIMEOUT_DELAY_64_CLK_Val << MPDDRC_LPR_TIMEOUT_Pos) /**< (MPDDRC_LPR) SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer. Position  */
#define MPDDRC_LPR_TIMEOUT_DELAY_128_CLK      (MPDDRC_LPR_TIMEOUT_DELAY_128_CLK_Val << MPDDRC_LPR_TIMEOUT_Pos) /**< (MPDDRC_LPR) SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer. Position  */
#define MPDDRC_LPR_APDE_Pos                   _U_(16)                                              /**< (MPDDRC_LPR) Active Power Down Exit Time Position */
#define MPDDRC_LPR_APDE_Msk                   (_U_(0x1) << MPDDRC_LPR_APDE_Pos)                    /**< (MPDDRC_LPR) Active Power Down Exit Time Mask */
#define MPDDRC_LPR_APDE(value)                (MPDDRC_LPR_APDE_Msk & ((value) << MPDDRC_LPR_APDE_Pos))
#define   MPDDRC_LPR_APDE_DDR2_FAST_EXIT_Val  _U_(0x0)                                             /**< (MPDDRC_LPR) Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.  */
#define   MPDDRC_LPR_APDE_DDR2_SLOW_EXIT_Val  _U_(0x1)                                             /**< (MPDDRC_LPR) Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.  */
#define MPDDRC_LPR_APDE_DDR2_FAST_EXIT        (MPDDRC_LPR_APDE_DDR2_FAST_EXIT_Val << MPDDRC_LPR_APDE_Pos) /**< (MPDDRC_LPR) Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only. Position  */
#define MPDDRC_LPR_APDE_DDR2_SLOW_EXIT        (MPDDRC_LPR_APDE_DDR2_SLOW_EXIT_Val << MPDDRC_LPR_APDE_Pos) /**< (MPDDRC_LPR) Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only. Position  */
#define MPDDRC_LPR_UPD_MR_Pos                 _U_(20)                                              /**< (MPDDRC_LPR) Update Load Mode Register and Extended Mode Register Position */
#define MPDDRC_LPR_UPD_MR_Msk                 (_U_(0x3) << MPDDRC_LPR_UPD_MR_Pos)                  /**< (MPDDRC_LPR) Update Load Mode Register and Extended Mode Register Mask */
#define MPDDRC_LPR_UPD_MR(value)              (MPDDRC_LPR_UPD_MR_Msk & ((value) << MPDDRC_LPR_UPD_MR_Pos))
#define   MPDDRC_LPR_UPD_MR_NO_UPDATE_Val     _U_(0x0)                                             /**< (MPDDRC_LPR) Update of Load Mode and Extended Mode registers is disabled.  */
#define   MPDDRC_LPR_UPD_MR_UPDATE_SHAREDBUS_Val _U_(0x1)                                             /**< (MPDDRC_LPR) MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device.  */
#define   MPDDRC_LPR_UPD_MR_UPDATE_NOSHAREDBUS_Val _U_(0x2)                                             /**< (MPDDRC_LPR) MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode.  */
#define MPDDRC_LPR_UPD_MR_NO_UPDATE           (MPDDRC_LPR_UPD_MR_NO_UPDATE_Val << MPDDRC_LPR_UPD_MR_Pos) /**< (MPDDRC_LPR) Update of Load Mode and Extended Mode registers is disabled. Position  */
#define MPDDRC_LPR_UPD_MR_UPDATE_SHAREDBUS    (MPDDRC_LPR_UPD_MR_UPDATE_SHAREDBUS_Val << MPDDRC_LPR_UPD_MR_Pos) /**< (MPDDRC_LPR) MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device. Position  */
#define MPDDRC_LPR_UPD_MR_UPDATE_NOSHAREDBUS  (MPDDRC_LPR_UPD_MR_UPDATE_NOSHAREDBUS_Val << MPDDRC_LPR_UPD_MR_Pos) /**< (MPDDRC_LPR) MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode. Position  */
#define MPDDRC_LPR_CHG_FRQ_Pos                _U_(24)                                              /**< (MPDDRC_LPR) Change Clock Frequency During Self-refresh Mode Position */
#define MPDDRC_LPR_CHG_FRQ_Msk                (_U_(0x1) << MPDDRC_LPR_CHG_FRQ_Pos)                 /**< (MPDDRC_LPR) Change Clock Frequency During Self-refresh Mode Mask */
#define MPDDRC_LPR_CHG_FRQ(value)             (MPDDRC_LPR_CHG_FRQ_Msk & ((value) << MPDDRC_LPR_CHG_FRQ_Pos))
#define MPDDRC_LPR_SELF_DONE_Pos              _U_(25)                                              /**< (MPDDRC_LPR) Self-refresh is done (read-only) Position */
#define MPDDRC_LPR_SELF_DONE_Msk              (_U_(0x1) << MPDDRC_LPR_SELF_DONE_Pos)               /**< (MPDDRC_LPR) Self-refresh is done (read-only) Mask */
#define MPDDRC_LPR_SELF_DONE(value)           (MPDDRC_LPR_SELF_DONE_Msk & ((value) << MPDDRC_LPR_SELF_DONE_Pos))
#define MPDDRC_LPR_Msk                        _U_(0x0331377F)                                      /**< (MPDDRC_LPR) Register Mask  */


