Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_usart_echo_interrupt/firmware/src/packs/ATSAMA5D27_DFP/component/mpddrc.h
/* -------- MPDDRC_REQ_PORT_4567 : (MPDDRC Offset: 0x50) (R/W 32) Request Port 4-5-6-7 Register -------- */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos _U_(0)                                               /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Msk (_U_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos) /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Msk & ((value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos))
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos _U_(8)                                               /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Msk (_U_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos) /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Msk & ((value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos))
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos _U_(16)                                              /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Msk (_U_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos) /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Msk & ((value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos))
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos _U_(24)                                              /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Msk (_U_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos) /**< (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Msk & ((value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos))
#define MPDDRC_REQ_PORT_4567_Msk              _U_(0xFFFFFFFF)                                      /**< (MPDDRC_REQ_PORT_4567) Register Mask  */


/* -------- MPDDRC_BDW_PORT_0123 : (MPDDRC Offset: 0x54) ( R/ 32) Current/Maximum Bandwidth Port 0-1-2-3 Register -------- */
#define MPDDRC_BDW_PORT_0123_BDW_P0_Pos       _U_(0)                                               /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P0_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P0_Pos)       /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P0(value)    (MPDDRC_BDW_PORT_0123_BDW_P0_Msk & ((value) << MPDDRC_BDW_PORT_0123_BDW_P0_Pos))
#define MPDDRC_BDW_PORT_0123_BDW_P1_Pos       _U_(8)                                               /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P1_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P1_Pos)       /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P1(value)    (MPDDRC_BDW_PORT_0123_BDW_P1_Msk & ((value) << MPDDRC_BDW_PORT_0123_BDW_P1_Pos))
#define MPDDRC_BDW_PORT_0123_BDW_P2_Pos       _U_(16)                                              /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P2_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P2_Pos)       /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P2(value)    (MPDDRC_BDW_PORT_0123_BDW_P2_Msk & ((value) << MPDDRC_BDW_PORT_0123_BDW_P2_Pos))
#define MPDDRC_BDW_PORT_0123_BDW_P3_Pos       _U_(24)                                              /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P3_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P3_Pos)       /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P3(value)    (MPDDRC_BDW_PORT_0123_BDW_P3_Msk & ((value) << MPDDRC_BDW_PORT_0123_BDW_P3_Pos))
#define MPDDRC_BDW_PORT_0123_Msk              _U_(0x7F7F7F7F)                                      /**< (MPDDRC_BDW_PORT_0123) Register Mask  */


/* -------- MPDDRC_BDW_PORT_4567 : (MPDDRC Offset: 0x58) ( R/ 32) Current/Maximum Bandwidth Port 4-5-6-7 Register -------- */
#define MPDDRC_BDW_PORT_4567_BDW_P4_Pos       _U_(0)                                               /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P4_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P4_Pos)       /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P4(value)    (MPDDRC_BDW_PORT_4567_BDW_P4_Msk & ((value) << MPDDRC_BDW_PORT_4567_BDW_P4_Pos))
#define MPDDRC_BDW_PORT_4567_BDW_P5_Pos       _U_(8)                                               /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P5_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P5_Pos)       /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P5(value)    (MPDDRC_BDW_PORT_4567_BDW_P5_Msk & ((value) << MPDDRC_BDW_PORT_4567_BDW_P5_Pos))
#define MPDDRC_BDW_PORT_4567_BDW_P6_Pos       _U_(16)                                              /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P6_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P6_Pos)       /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P6(value)    (MPDDRC_BDW_PORT_4567_BDW_P6_Msk & ((value) << MPDDRC_BDW_PORT_4567_BDW_P6_Pos))
#define MPDDRC_BDW_PORT_4567_BDW_P7_Pos       _U_(24)                                              /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P7_Msk       (_U_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P7_Pos)       /**< (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P7(value)    (MPDDRC_BDW_PORT_4567_BDW_P7_Msk & ((value) << MPDDRC_BDW_PORT_4567_BDW_P7_Pos))
#define MPDDRC_BDW_PORT_4567_Msk              _U_(0x7F7F7F7F)                                      /**< (MPDDRC_BDW_PORT_4567) Register Mask  */


/* -------- MPDDRC_RD_DATA_PATH : (MPDDRC Offset: 0x5C) (R/W 32) Read Data Path Register -------- */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos _U_(0)                                               /**< (MPDDRC_RD_DATA_PATH) Shift Sampling Point of Data Position */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Msk (_U_(0x3) << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /**< (MPDDRC_RD_DATA_PATH) Shift Sampling Point of Data Mask */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING(value) (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Msk & ((value) << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos))
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT_Val _U_(0x0)                                             /**< (MPDDRC_RD_DATA_PATH) Initial sampling point.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val _U_(0x1)                                             /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by one cycle.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val _U_(0x2)                                             /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by two cycles.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val _U_(0x3)                                             /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices.  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /**< (MPDDRC_RD_DATA_PATH) Initial sampling point. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by one cycle. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by two cycles. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /**< (MPDDRC_RD_DATA_PATH) Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices. Position  */
#define MPDDRC_RD_DATA_PATH_Msk               _U_(0x00000003)                                      /**< (MPDDRC_RD_DATA_PATH) Register Mask  */


/* -------- MPDDRC_MCFGR : (MPDDRC Offset: 0x60) (R/W 32) Monitor Configuration Register -------- */
#define MPDDRC_MCFGR_EN_MONI_Pos              _U_(0)                                               /**< (MPDDRC_MCFGR) Enable Monitor Position */
#define MPDDRC_MCFGR_EN_MONI_Msk              (_U_(0x1) << MPDDRC_MCFGR_EN_MONI_Pos)               /**< (MPDDRC_MCFGR) Enable Monitor Mask */
#define MPDDRC_MCFGR_EN_MONI(value)           (MPDDRC_MCFGR_EN_MONI_Msk & ((value) << MPDDRC_MCFGR_EN_MONI_Pos))
#define MPDDRC_MCFGR_SOFT_RESET_Pos           _U_(1)                                               /**< (MPDDRC_MCFGR) Soft Reset Position */
#define MPDDRC_MCFGR_SOFT_RESET_Msk           (_U_(0x1) << MPDDRC_MCFGR_SOFT_RESET_Pos)            /**< (MPDDRC_MCFGR) Soft Reset Mask */
#define MPDDRC_MCFGR_SOFT_RESET(value)        (MPDDRC_MCFGR_SOFT_RESET_Msk & ((value) << MPDDRC_MCFGR_SOFT_RESET_Pos))
#define MPDDRC_MCFGR_RUN_Pos                  _U_(4)                                               /**< (MPDDRC_MCFGR) Control Monitor Position */
#define MPDDRC_MCFGR_RUN_Msk                  (_U_(0x1) << MPDDRC_MCFGR_RUN_Pos)                   /**< (MPDDRC_MCFGR) Control Monitor Mask */
#define MPDDRC_MCFGR_RUN(value)               (MPDDRC_MCFGR_RUN_Msk & ((value) << MPDDRC_MCFGR_RUN_Pos))
#define MPDDRC_MCFGR_READ_WRITE_Pos           _U_(8)                                               /**< (MPDDRC_MCFGR) Read/Write Access Position */
#define MPDDRC_MCFGR_READ_WRITE_Msk           (_U_(0x3) << MPDDRC_MCFGR_READ_WRITE_Pos)            /**< (MPDDRC_MCFGR) Read/Write Access Mask */
#define MPDDRC_MCFGR_READ_WRITE(value)        (MPDDRC_MCFGR_READ_WRITE_Msk & ((value) << MPDDRC_MCFGR_READ_WRITE_Pos))
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR_Val _U_(0x0)                                             /**< (MPDDRC_MCFGR) Read and Write accesses are triggered.  */
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_WR_Val _U_(0x1)                                             /**< (MPDDRC_MCFGR) Only Write accesses are triggered.  */
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_RD_Val _U_(0x2)                                             /**< (MPDDRC_MCFGR) Only Read accesses are triggered.  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR    (MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /**< (MPDDRC_MCFGR) Read and Write accesses are triggered. Position  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_WR       (MPDDRC_MCFGR_READ_WRITE_TRIG_WR_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /**< (MPDDRC_MCFGR) Only Write accesses are triggered. Position  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_RD       (MPDDRC_MCFGR_READ_WRITE_TRIG_RD_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /**< (MPDDRC_MCFGR) Only Read accesses are triggered. Position  */
#define MPDDRC_MCFGR_REFR_CALIB_Pos           _U_(10)                                              /**< (MPDDRC_MCFGR) Refresh Calibration Position */
#define MPDDRC_MCFGR_REFR_CALIB_Msk           (_U_(0x1) << MPDDRC_MCFGR_REFR_CALIB_Pos)            /**< (MPDDRC_MCFGR) Refresh Calibration Mask */
#define MPDDRC_MCFGR_REFR_CALIB(value)        (MPDDRC_MCFGR_REFR_CALIB_Msk & ((value) << MPDDRC_MCFGR_REFR_CALIB_Pos))
#define MPDDRC_MCFGR_INFO_Pos                 _U_(11)                                              /**< (MPDDRC_MCFGR) Information Type Position */
#define MPDDRC_MCFGR_INFO_Msk                 (_U_(0x3) << MPDDRC_MCFGR_INFO_Pos)                  /**< (MPDDRC_MCFGR) Information Type Mask */
#define MPDDRC_MCFGR_INFO(value)              (MPDDRC_MCFGR_INFO_Msk & ((value) << MPDDRC_MCFGR_INFO_Pos))
#define   MPDDRC_MCFGR_INFO_MAX_WAIT_Val      _U_(0x0)                                             /**< (MPDDRC_MCFGR) Information concerning the transfer with the longest waiting time  */
#define   MPDDRC_MCFGR_INFO_NB_TRANSFERS_Val  _U_(0x1)                                             /**< (MPDDRC_MCFGR) Number of transfers on the port  */
#define   MPDDRC_MCFGR_INFO_TOTAL_LATENCY_Val _U_(0x2)                                             /**< (MPDDRC_MCFGR) Total latency on the port  */
#define MPDDRC_MCFGR_INFO_MAX_WAIT            (MPDDRC_MCFGR_INFO_MAX_WAIT_Val << MPDDRC_MCFGR_INFO_Pos) /**< (MPDDRC_MCFGR) Information concerning the transfer with the longest waiting time Position  */
#define MPDDRC_MCFGR_INFO_NB_TRANSFERS        (MPDDRC_MCFGR_INFO_NB_TRANSFERS_Val << MPDDRC_MCFGR_INFO_Pos) /**< (MPDDRC_MCFGR) Number of transfers on the port Position  */
#define MPDDRC_MCFGR_INFO_TOTAL_LATENCY       (MPDDRC_MCFGR_INFO_TOTAL_LATENCY_Val << MPDDRC_MCFGR_INFO_Pos) /**< (MPDDRC_MCFGR) Total latency on the port Position  */
#define MPDDRC_MCFGR_Msk                      _U_(0x00001F13)                                      /**< (MPDDRC_MCFGR) Register Mask  */


/* -------- MPDDRC_MADDR0 : (MPDDRC Offset: 0x64) (R/W 32) Monitor Address High/Low Port 0 Register -------- */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos      _U_(0)                                               /**< (MPDDRC_MADDR0) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0_Msk      (_U_(0xFFFF) << MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos)    /**< (MPDDRC_MADDR0) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0(value)   (MPDDRC_MADDR0_ADDR_LOW_PORT0_Msk & ((value) << MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos))
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos     _U_(16)                                              /**< (MPDDRC_MADDR0) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0_Msk     (_U_(0xFFFF) << MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos)   /**< (MPDDRC_MADDR0) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0(value)  (MPDDRC_MADDR0_ADDR_HIGH_PORT0_Msk & ((value) << MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos))
#define MPDDRC_MADDR0_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR0) Register Mask  */


/* -------- MPDDRC_MADDR1 : (MPDDRC Offset: 0x68) (R/W 32) Monitor Address High/Low Port 1 Register -------- */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos      _U_(0)                                               /**< (MPDDRC_MADDR1) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1_Msk      (_U_(0xFFFF) << MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos)    /**< (MPDDRC_MADDR1) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1(value)   (MPDDRC_MADDR1_ADDR_LOW_PORT1_Msk & ((value) << MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos))
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos     _U_(16)                                              /**< (MPDDRC_MADDR1) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1_Msk     (_U_(0xFFFF) << MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos)   /**< (MPDDRC_MADDR1) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1(value)  (MPDDRC_MADDR1_ADDR_HIGH_PORT1_Msk & ((value) << MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos))
#define MPDDRC_MADDR1_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR1) Register Mask  */


/* -------- MPDDRC_MADDR2 : (MPDDRC Offset: 0x6C) (R/W 32) Monitor Address High/Low Port 2 Register -------- */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos      _U_(0)                                               /**< (MPDDRC_MADDR2) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2_Msk      (_U_(0xFFFF) << MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos)    /**< (MPDDRC_MADDR2) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2(value)   (MPDDRC_MADDR2_ADDR_LOW_PORT2_Msk & ((value) << MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos))
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos     _U_(16)                                              /**< (MPDDRC_MADDR2) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2_Msk     (_U_(0xFFFF) << MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos)   /**< (MPDDRC_MADDR2) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2(value)  (MPDDRC_MADDR2_ADDR_HIGH_PORT2_Msk & ((value) << MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos))
#define MPDDRC_MADDR2_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR2) Register Mask  */


/* -------- MPDDRC_MADDR3 : (MPDDRC Offset: 0x70) (R/W 32) Monitor Address High/Low Port 3 Register -------- */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos      _U_(0)                                               /**< (MPDDRC_MADDR3) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3_Msk      (_U_(0xFFFF) << MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos)    /**< (MPDDRC_MADDR3) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3(value)   (MPDDRC_MADDR3_ADDR_LOW_PORT3_Msk & ((value) << MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos))
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos     _U_(16)                                              /**< (MPDDRC_MADDR3) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3_Msk     (_U_(0xFFFF) << MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos)   /**< (MPDDRC_MADDR3) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3(value)  (MPDDRC_MADDR3_ADDR_HIGH_PORT3_Msk & ((value) << MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos))
#define MPDDRC_MADDR3_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR3) Register Mask  */


/* -------- MPDDRC_MADDR4 : (MPDDRC Offset: 0x74) (R/W 32) Monitor Address High/Low Port 4 Register -------- */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos      _U_(0)                                               /**< (MPDDRC_MADDR4) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4_Msk      (_U_(0xFFFF) << MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos)    /**< (MPDDRC_MADDR4) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4(value)   (MPDDRC_MADDR4_ADDR_LOW_PORT4_Msk & ((value) << MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos))
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos     _U_(16)                                              /**< (MPDDRC_MADDR4) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4_Msk     (_U_(0xFFFF) << MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos)   /**< (MPDDRC_MADDR4) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4(value)  (MPDDRC_MADDR4_ADDR_HIGH_PORT4_Msk & ((value) << MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos))
#define MPDDRC_MADDR4_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR4) Register Mask  */


/* -------- MPDDRC_MADDR5 : (MPDDRC Offset: 0x78) (R/W 32) Monitor Address High/Low Port 5 Register -------- */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos      _U_(0)                                               /**< (MPDDRC_MADDR5) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5_Msk      (_U_(0xFFFF) << MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos)    /**< (MPDDRC_MADDR5) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5(value)   (MPDDRC_MADDR5_ADDR_LOW_PORT5_Msk & ((value) << MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos))
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos     _U_(16)                                              /**< (MPDDRC_MADDR5) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5_Msk     (_U_(0xFFFF) << MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos)   /**< (MPDDRC_MADDR5) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5(value)  (MPDDRC_MADDR5_ADDR_HIGH_PORT5_Msk & ((value) << MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos))
#define MPDDRC_MADDR5_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR5) Register Mask  */


/* -------- MPDDRC_MADDR6 : (MPDDRC Offset: 0x7C) (R/W 32) Monitor Address High/Low Port 6 Register -------- */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos      _U_(0)                                               /**< (MPDDRC_MADDR6) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6_Msk      (_U_(0xFFFF) << MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos)    /**< (MPDDRC_MADDR6) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6(value)   (MPDDRC_MADDR6_ADDR_LOW_PORT6_Msk & ((value) << MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos))
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos     _U_(16)                                              /**< (MPDDRC_MADDR6) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6_Msk     (_U_(0xFFFF) << MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos)   /**< (MPDDRC_MADDR6) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6(value)  (MPDDRC_MADDR6_ADDR_HIGH_PORT6_Msk & ((value) << MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos))
#define MPDDRC_MADDR6_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR6) Register Mask  */


/* -------- MPDDRC_MADDR7 : (MPDDRC Offset: 0x80) (R/W 32) Monitor Address High/Low Port 7 Register -------- */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos      _U_(0)                                               /**< (MPDDRC_MADDR7) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7_Msk      (_U_(0xFFFF) << MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos)    /**< (MPDDRC_MADDR7) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7(value)   (MPDDRC_MADDR7_ADDR_LOW_PORT7_Msk & ((value) << MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos))
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos     _U_(16)                                              /**< (MPDDRC_MADDR7) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7_Msk     (_U_(0xFFFF) << MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos)   /**< (MPDDRC_MADDR7) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7(value)  (MPDDRC_MADDR7_ADDR_HIGH_PORT7_Msk & ((value) << MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos))
#define MPDDRC_MADDR7_Msk                     _U_(0xFFFFFFFF)                                      /**< (MPDDRC_MADDR7) Register Mask  */


/* -------- MPDDRC_MINFO0 : (MPDDRC Offset: 0x84) ( R/ 32) Monitor Information Port 0 Register -------- */
#define MPDDRC_MINFO0_Msk                     _U_(0x00000000)                                      /**< (MPDDRC_MINFO0) Register Mask  */

